loadtest/results/portfolio.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/portfolio.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m25s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 55s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 02/20 VUs  01.0s/55.0s

running (0m02.0s), 03/20 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 03/20 VUs  02.0s/55.0s

running (0m03.0s), 04/20 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 04/20 VUs  03.0s/55.0s

running (0m04.0s), 06/20 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 06/20 VUs  04.0s/55.0s

running (0m05.0s), 07/20 VUs, 15 complete and 0 interrupted iterations
default   [   9% ] 07/20 VUs  05.0s/55.0s

running (0m06.0s), 08/20 VUs, 22 complete and 0 interrupted iterations
default   [  11% ] 08/20 VUs  06.0s/55.0s

running (0m07.0s), 09/20 VUs, 30 complete and 0 interrupted iterations
default   [  13% ] 09/20 VUs  07.0s/55.0s

running (0m08.0s), 11/20 VUs, 39 complete and 0 interrupted iterations
default   [  15% ] 11/20 VUs  08.0s/55.0s

running (0m09.0s), 12/20 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 12/20 VUs  09.0s/55.0s

running (0m10.0s), 13/20 VUs, 62 complete and 0 interrupted iterations
default   [  18% ] 13/20 VUs  10.0s/55.0s

running (0m11.0s), 14/20 VUs, 74 complete and 0 interrupted iterations
default   [  20% ] 14/20 VUs  11.0s/55.0s

running (0m12.0s), 16/20 VUs, 88 complete and 0 interrupted iterations
default   [  22% ] 16/20 VUs  12.0s/55.0s

running (0m13.0s), 17/20 VUs, 104 complete and 0 interrupted iterations
default   [  24% ] 17/20 VUs  13.0s/55.0s

running (0m14.0s), 18/20 VUs, 121 complete and 0 interrupted iterations
default   [  25% ] 18/20 VUs  14.0s/55.0s

running (0m15.0s), 19/20 VUs, 139 complete and 0 interrupted iterations
default   [  27% ] 19/20 VUs  15.0s/55.0s

running (0m16.0s), 20/20 VUs, 158 complete and 0 interrupted iterations
default   [  29% ] 20/20 VUs  16.0s/55.0s

running (0m17.0s), 20/20 VUs, 178 complete and 0 interrupted iterations
default   [  31% ] 20/20 VUs  17.0s/55.0s

running (0m18.0s), 20/20 VUs, 198 complete and 0 interrupted iterations
default   [  33% ] 20/20 VUs  18.0s/55.0s

running (0m19.0s), 20/20 VUs, 218 complete and 0 interrupted iterations
default   [  35% ] 20/20 VUs  19.0s/55.0s

running (0m20.0s), 20/20 VUs, 238 complete and 0 interrupted iterations
default   [  36% ] 20/20 VUs  20.0s/55.0s

running (0m21.0s), 20/20 VUs, 258 complete and 0 interrupted iterations
default   [  38% ] 20/20 VUs  21.0s/55.0s

running (0m22.0s), 20/20 VUs, 278 complete and 0 interrupted iterations
default   [  40% ] 20/20 VUs  22.0s/55.0s

running (0m23.0s), 20/20 VUs, 298 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  23.0s/55.0s

running (0m24.0s), 20/20 VUs, 318 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  24.0s/55.0s

running (0m25.0s), 20/20 VUs, 338 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  25.0s/55.0s

running (0m26.0s), 20/20 VUs, 358 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  26.0s/55.0s

running (0m27.0s), 20/20 VUs, 378 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  27.0s/55.0s

running (0m28.0s), 20/20 VUs, 398 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  28.0s/55.0s

running (0m29.0s), 20/20 VUs, 418 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  29.0s/55.0s

running (0m30.0s), 20/20 VUs, 438 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  30.0s/55.0s

running (0m31.0s), 20/20 VUs, 458 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  31.0s/55.0s

running (0m32.0s), 20/20 VUs, 478 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  32.0s/55.0s

running (0m33.0s), 20/20 VUs, 498 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  33.0s/55.0s

running (0m34.0s), 20/20 VUs, 518 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  34.0s/55.0s

running (0m35.0s), 20/20 VUs, 538 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  35.0s/55.0s

running (0m36.0s), 20/20 VUs, 557 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  36.0s/55.0s

running (0m37.0s), 20/20 VUs, 577 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  37.0s/55.0s

running (0m38.0s), 20/20 VUs, 597 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  38.0s/55.0s

running (0m39.0s), 20/20 VUs, 617 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  39.0s/55.0s

running (0m40.0s), 20/20 VUs, 637 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  40.0s/55.0s

running (0m41.0s), 20/20 VUs, 657 complete and 0 interrupted iterations
default   [  75% ] 20/20 VUs  41.0s/55.0s

running (0m42.0s), 20/20 VUs, 677 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  42.0s/55.0s

running (0m43.0s), 20/20 VUs, 697 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  43.0s/55.0s

running (0m44.0s), 20/20 VUs, 717 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  44.0s/55.0s

running (0m45.0s), 20/20 VUs, 737 complete and 0 interrupted iterations
default   [  82% ] 20/20 VUs  45.0s/55.0s

running (0m46.0s), 20/20 VUs, 757 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  46.0s/55.0s

running (0m47.0s), 17/20 VUs, 777 complete and 0 interrupted iterations
default   [  85% ] 17/20 VUs  47.0s/55.0s

running (0m48.0s), 15/20 VUs, 794 complete and 0 interrupted iterations
default   [  87% ] 15/20 VUs  48.0s/55.0s

running (0m49.0s), 14/20 VUs, 809 complete and 0 interrupted iterations
default   [  89% ] 14/20 VUs  49.0s/55.0s

running (0m50.0s), 11/20 VUs, 823 complete and 0 interrupted iterations
default   [  91% ] 11/20 VUs  50.0s/55.0s

running (0m51.0s), 10/20 VUs, 834 complete and 0 interrupted iterations
default   [  93% ] 10/20 VUs  51.0s/55.0s

running (0m52.0s), 07/20 VUs, 844 complete and 0 interrupted iterations
default   [  95% ] 07/20 VUs  52.0s/55.0s

running (0m53.0s), 06/20 VUs, 851 complete and 0 interrupted iterations
default   [  96% ] 06/20 VUs  53.0s/55.0s

running (0m54.0s), 03/20 VUs, 856 complete and 0 interrupted iterations
default   [  98% ] 03/20 VUs  54.0s/55.0s

running (0m55.0s), 02/20 VUs, 859 complete and 0 interrupted iterations
default   [ 100% ] 02/20 VUs  55.0s/55.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=5.27ms

    http_req_failed
    ✗ 'rate<0.01' rate=40.30%


  █ TOTAL RESULTS 

    checks_total.......: 2583   46.755607/s
    checks_succeeded...: 59.69% 1542 out of 2583
    checks_failed......: 40.30% 1041 out of 2583

    ✗ status is 200
      ↳  59% — ✓ 514 / ✗ 347
    ✗ has summary
      ↳  59% — ✓ 514 / ✗ 347
    ✗ has holdings
      ↳  59% — ✓ 514 / ✗ 347

    HTTP
    http_req_duration..............: avg=2.86ms min=367µs  med=3.07ms max=24.08ms p(90)=4.61ms p(95)=5.27ms
      { expected_response:true }...: avg=3.97ms min=1.27ms med=3.81ms max=24.08ms p(90)=5.11ms p(95)=5.72ms
    http_req_failed................: 40.30% 347 out of 861
    http_reqs......................: 861    15.585202/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s     med=1s     max=1.03s   p(90)=1s     p(95)=1s    
    iterations.....................: 861    15.585202/s
    vus............................: 2      min=2          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 18 MB  320 kB/s
    data_sent......................: 79 kB  1.4 kB/s



running (0m55.2s), 00/20 VUs, 861 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  55s
time="2026-05-05T23:02:02+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"